app/Controllers/User.php

    public function login()
    {
        $user = $this->userModel->where('user_name', $this->request->getJsonVar('user_name'))->first();

        if($user){
            if($user['password'] == hash('sha256', $this->request->getJsonVar('password'))){

                //delete old token
                $this->tokenModel->where('user_name',$this->request->getJsonVar('user_name'))->where('uuid',$this->request->getJsonVar('uuid'))->delete();

                $token_generator = bin2hex(openssl_random_pseudo_bytes(8));
                $token_data = [
                    'uuid' => $this->request->getJsonVar('uuid'),
                    'user_name' => $this->request->getJsonVar('user_name'),
                    'token' => 'token_'.$token_generator
                ];

                $this->tokenModel->insert($token_data);
---
SELECT *
FROM `t_user`
WHERE `user_name` = 'anang'
 LIMIT 1
DELETE FROM `t_token`
WHERE `user_name` = 'anang'
AND `uuid` = 'abc'
INSERT INTO `t_token` (`uuid`, `user_name`, `token`) VALUES ('abc', 'anang', 'token_038740a545000146')